javascript_project_4_backend/app/controllers/characters_controller.rb

    def index
        characters = Character.all
---
SELECT "characters".* FROM "characters"

    def update
        # binding.pry
        character = Character.find_by(id: params[:id])
        character.update(:status)
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "characters" SET "status" = ?, "updated_at" = ? WHERE "characters"."id" = ?  [["status", 1], ["updated_at", "2020-04-15 16:28:20.886471"], ["id", 29]]

    def show
        character = Character.find_by(id: params[:id])
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]

    def destroy
        # binding.pry
        character = Character.find_by(id: params[:id])
        character.destroy
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 19]]